const studentName = 'أحمد';
const title = 'امتحان الشهر الأول';
const maxScore = 20;
const score = 18;
const isAbsent = false;

const text = `السلام عليكم ورحمة الله وبركاته،
ولي أمر الطالب/ة: ${studentName}

تحية طيبة وبعد من نظام الدكتور للغة العربية،
نود إبلاغكم بنتيجة الطالب/ة في ${title}:

${isAbsent ? '🔴 *الطالب/ة كان غائباً عن الامتحان*' : `📊 *الدرجة الحاصل عليها:* ${score} من ${maxScore} درجة.`}

يرجى الاهتمام والمتابعة مع السنتر حرصاً على التفوق الأكاديمي للطالب/ة.
شاكرين لسيادتكم حسن التعاون.`
console.log(text);
